# frozen_string_literal: true

tap 'aquasecurity/trivy'
tap 'timescale/tap'

brew 'actionlint'
brew 'atuin'
brew 'aws-sso-cli'
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'docker-credential-helper'
brew 'docker-credential-helper-ecr'
brew 'exercism'
brew 'eza'
brew 'fd'
brew 'fswatch'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gobuster'
brew 'graphviz'
brew 'grype'
brew 'hl'
brew 'htop'
brew 'ipcalc'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'kubectl'
brew 'libpq'
brew 'marp-cli'
brew 'mise'
brew 'neovim'
brew 'pipx'
brew 'podman'
brew 'pre-commit'
brew 'prettier'
brew 'ripgrep'
brew 'rsync'
brew 'shfmt'
brew 'sqlcipher'
brew 'starship'
brew 'stow'
brew 'temporal'
brew 'timg'
brew 'timescale/tap/timescaledb-tools'
brew 'terminal-notifier'
brew 'terraform-docs'
brew 'tflint'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tree'
brew 'trivy'
brew 'uv'
brew 'vale'
brew 'vim'
brew 'vips'
brew 'watch'
brew 'ykman'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'cursor'
cask 'cursor-cli'
cask 'font-fira-code-nerd-font'
cask 'font-inter'
cask 'font-jetbrains-mono-nerd-font'
cask 'gcloud-cli'
cask 'ghostty'
cask 'podman-desktop'
cask 'rectangle'
cask 'session-manager-plugin'
cask 'slack-cli'
cask 'snowflake-snowsql'
cask 'yubico-authenticator'
