# frozen_string_literal: true

tap 'aquasecurity/trivy'

brew 'actionlint'
brew 'atuin'
brew 'awscli'
brew 'bat'
brew 'direnv'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'htop'
brew 'jq'
brew 'kubectl'
brew 'mise'
brew 'neovim'
brew 'pre-commit'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'starship'
brew 'stow'
brew 'tmux'
brew 'vale'
brew 'vim'
brew 'zoxide'
brew 'zsh'

cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'gcloud-cli'
cask 'ghostty'
cask 'podman-desktop'
cask 'rectangle'
cask 'session-manager-plugin'
cask 'yubico-yubikey-manager'
