tap "aquasecurity/trivy"

brew "git"
brew "stow"
brew "zsh"
brew "starship"
brew "zoxide"
brew "atuin"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "mise"
brew "tmux"
brew "htop"
brew "gh"
brew "kubectl"
brew "jq"
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "actionlint"
brew "mise"
brew "awscli"
brew "vim"
brew "neovim"
brew "direnv"
brew "vale"

cask "ghostty"
cask "gcloud-cli"
cask "session-manager-plugin"
cask "rectangle"
cask "yubico-yubikey-manager"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "podman-desktop"
