amazonwebservices.aws-toolkit-vscode
anysphere.remote-containers
aquasecurityofficial.trivy-vulnerability-scanner
bpruitt-goddard.mermaid-markdown-syntax-highlighting
davidanson.vscode-markdownlint
eamodio.gitlens
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.terraform
hbenl.vscode-test-explorer
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.test-adapter-converter
openai.chatgpt
premparihar.gotestexplorer
redhat.vscode-yaml
rubocop.vscode-rubocop
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
timonwong.shellcheck
vscodevim.vim
